{
    "2024-10-10": [
        "The increasingly outspoken tech mogul spoke at a Trump rally this weekend in one of the most contested battleground states.",
        "Will Elon Musk Tip the Election for Trump?",
        "The Federal Communications Commission rejected Trump’s call to revoke CBS’s broadcast license due to sharing two edits of Harris’ response to an interview question.",
        "FCC chair rejects Trump’s call to revoke CBS license over Harris interview edit",
        "Donald Trump's daughter Tiffany Trump and her husband Michael Boulos got married at Mar-a-Lago in 2022.",
        "Tiffany Trump and Michael Boulos are expecting their first child. Here's a timeline of their relationship.",
        "Donald Trump was born June 14, 1946, in Queens. Learn more about his family, real estate business, and time as the United States' 45th president.",
        "Donald Trump is running for president for the third time. Here's the lowdown on his personal life, career, and politics.",
        "Trump was slated to announce a new economic proposal in Detroit. It took him quite a bit of time to get to it.",
        "In rambling, hours-long speech, Trump introduces new car loan tax proposal"
    ],
    "2024-10-28": [
        "Some of the most powerful people in Silicon Valley appear to be quietly sitting out the presidential election cycle. But Trump says that in private, it's a different story.",
        "A Running List of the Tech CEOs Donald Trump Claims Are Calling Him to Suck Up",
        "Who is Tony Hinchcliffe?",
        "Google Searches for Comedian Who Told Racist Jokes at Trump Rally Surpass Taylor Swift",
        "The lawsuit is the first official legal action against the billionaire's election lottery scheme.",
        "Musk Screams at Trump Rally as Philly DA Sues to Stop $1 Million Voter Giveaway",
        "A government memo viewed by WIRED states that insider threats “could derail or jeopardize a fair and transparent election process.”",
        "US Intel Says Insider Threats Are 'Likely' During the Election"
    ],
    "2024-10-16": [
        "Investors scooped up only a small number of the Trump family's new World Liberty Financial crypto tokens after website reliability issues interfered with a launch event.",
        "Trumpcoin Launches With a Whimper",
        "The Tesla CEO called his PAC \"centrist\" because you can just say whatever you want on the internet.",
        "Elon Musk Donates $75 Million to His Own Pro-Trump Group",
        "The former president has positioned himself as the pro-crypto candidate this election cycle. But he hasn't always had nice things to say about crypto.",
        "Trump flip-flopped on crypto, but his PAC has raked in millions of dollars of crypto donations since June",
        "Marc Andreessen and Ben Horowitz each donated $2.5 million to \"Right for America,\" a pro-Donald Trump super PAC, according to FEC filings.",
        "Marc Andreessen and Ben Horowitz each donated $2.5 million to a pro-Donald Trump super PAC"
    ],
    "2024-10-21": [
        "Donald Trump's opposition to “woke” safety standards for artificial intelligence would likely mean the dismantling of regulations that protect Americans from misinformation, discrimination, and worse.",
        "How a Trump Win Could Unleash Dangerous AI",
        "X has truly become a garbage heap since Trump donor Elon Musk bought the site.",
        "Trump Supporters’ Fake Stories About Harris and Walz Flood the ‘For You’ Page on X",
        "The now-exonerated men allege Trump spoke falsely of their case with \"reckless disregard\".",
        "Central Park Five sue Trump for defamation over debate claims",
        "Presidential candidates have often invoked McDonald's during their runs for the White House, both as a place to eat and as a place to work.",
        "McDonald's is the latest election battleground for Trump and Harris"
    ],
    "2024-10-24": [
        "The Trump and Harris campaigns have built huge networks of influencers and content creators. They have one last job—getting people out to vote.",
        "Influencers Get Their Final Marching Orders for the Election",
        "Ivanka Trump stepped back from politics when Donald Trump launched his 2024 campaign and has largely returned to her previous life as a socialite.",
        "Ivanka Trump has been absent from the 2024 campaign trail. Here's what she's been up to.",
        "Voter registration has closed in Pennsylvania anyway, so he probably doesn't feel a need to keep doing it.",
        "Elon Musk Appears to Have Stopped His $1 Million Voter Giveaway"
    ],
    "2024-10-29": [
        "Trump has promised to roll back Biden’s EV policies on “day one,” while Harris has avoided wading into the bizarre politicization of electric vehicles.",
        "This election will decide what kind of car you’ll buy",
        "Vice President Kamala Harris is taking on former President Donald Trump. The election will determine the future of everything from electric cars to the entire legal system to to our democracy itself.",
        "The Verge’s guide to the 2024 presidential election",
        "A strange tactic to take a week before an election, to say the least.",
        "Elon Musk Keeps Saying Trump Will Tank the Economy",
        "Within hours of being freed from a low-security prison where he’d been serving time on contempt charges, the MAGA architect was rallying his troops on a Rumble stream.",
        "Steve Bannon Is Out of Prison and Spreading Lies Online",
        "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "How X users can earn thousands from US election misinformation and AI images",
        "Our chief international correspondent Lyse Doucet hears from leading experts about what's at stake ahead of the vote.",
        "How this US election could change state of the world"
    ],
    "2024-10-31": [
        "A successful CIA hack of Venezuela's military payroll system, insider fights for spy agency resources, and messy opposition politics: A WIRED investigation reveals a secret Trump-era attempt to oust autocratic ruler Nicolás Maduro.",
        "The Untold Story of Trump's Failed Attempt to Overthrow Venezuela's President",
        "The state has been written off as a woke wasteland. But it's still inventing the future on a bunch of frontiers nobody's talking about. Even if Trump wins, it will remain a golden, global example.",
        "After the Election, California (Yes, That Hellscape) Will Keep Moving the World Forward No Matter What",
        "The group has nearly 50,000 members, many enthusiastically sharing debunked claims about voting fraud. “It's just an election denier jamboree,” says one expert.",
        "Elon Musk's America PAC Has Created an Election Denial Cesspool on X",
        "We’ve asked every member of Congress whether they’ll accept the results as called by the Associated Press. Use our tool to see how your representatives answer.",
        "Will Your Elected Officials in Congress Accept the Results of the Election?",
        "If you thought 2020 was bad, decisions from Big Tech and the US government have led to an internet that’s even worse off.",
        "Ahead of the Election, Social Media Platforms Have Given Up",
        "What a garbage heap.",
        "Scammy Ads on Facebook and Instagram Viewed 900 Million Times: Report",
        "BBC Verify investigates the claim by Elon Musk that Democrats import illegal immigrants to vote.",
        "Investigating Musk's far-fetched claim about Democrats importing voters",
        "Ukrainians on the front lines tell the BBC's James Waterhouse that their country’s survival is in the hands of Americans.",
        "As US votes, Ukraine’s future hangs in balance",
        "The 2024 presidential election has been full of memorable moments and unexpected twists.",
        "Photos show the biggest moments of the 2024 election so far"
    ],
    "2024-10-30": [
        "America PAC door knockers were flown to Michigan, driven in the back of a U-Haul, and told they’d have to pay hotel bills unless they met unrealistic quotas. One was surprised they were working to elect Donald Trump.",
        "Workers Say They Were Tricked and Threatened as Part of Elon Musk’s Get-Out-the-Vote Effort",
        "\"It’s what happens when you let a bunch of grifters take over,” a Trumpworld source said. Still, the polls remain even.",
        "Donald Trump's Ground Game in Michigan Is Mostly Glitchy Apps and Vibes",
        "[Removed]",
        "[Removed]",
        "The Democratic presidential candidate delivers her final message a week before election day.",
        "Harris pledges 'different path' at site of Trump 6 January rally",
        "It is the first presidential election since the top court overturned Roe v Wade, which protected the nationwide right to an abortion.",
        "'I'm not a one-issue voter, but this is huge': Abortion decided these women's votes",
        "Political prognosticators legally bet over $100 million on the 2024 presidential election, favoring Harris over Trump.",
        "Americans bet $100 million on Trump v. Harris, but at what cost?",
        "NPR sits down with North Carolina pastor Chad Harvey to talk about Donald Trump, religion and politics.",
        "Why are some Evangelicals drawn to — and sticking by — Trump? This pastor weighs in"
    ],
    "2024-10-07": [
        "Two photos from the event where Musk stumped for Trump became iconic fodder for the internet.",
        "Elon Musk Leaps Into the Meme History Books at Trump Rally",
        "The website formerly known as Twitter is a hotbed of far-right disinformation on the category 5 storm.",
        "Trump Fans Go Viral With Bizarre Conspiracy Theories About Hurricane Milton"
    ],
    "2024-10-23": [
        "Trump has previously called real videos of himself doing something embarrassing \"fake\" or AI.",
        "Why Are Trump Supporters Suddenly Freaked Out About Deepfakes?",
        "Recent, weirdly large pro-Trump bets have caught the attention of the platform's executives.",
        "Polymarket Is Looking Into Its Big Trump Bettors",
        "\"I think this was orchestrated by deep state Harris supporters after Trump’s visit to McDonald’s,\" one Trump supporter wrote.",
        "MAGA Faithful Say McDonald’s E. Coli Outbreak Is a Conspiracy to Hurt Trump",
        "Another legal issue to toss into the pile that he'll just ignore.",
        "Justice Department Warns Elon Musk That His $1 Million Voter Giveaway Might Be Illegal",
        "Sir Keir Starmer says his party sends volunteers to the US for 'pretty much every' presidential election.",
        "Labour volunteers helping Harris 'in spare time' - Starmer",
        "Elon Musk has increasingly thrown his massive influence — and wallet — behind Trump as Election Day nears.",
        "Elon Musk is becoming a key part of Trump's get-out-the-vote plan",
        "Trump's former chief of staff John Kelly confirmed previous reports that Trump told him Hitler \"did some good things,\" The New York Times reported.",
        "John Kelly says Trump told him more than once that Hitler 'did some good things'"
    ],
    "2024-11-01": [
        "A disinformation campaign is using the unmoderated spaces of right-wing news website comment sections to push their narratives.",
        "A Russian Disinfo Campaign Is Using Comment Sections to Seed Pro-Trump Conspiracy Theories",
        "Canvassers for California representative Michelle Steel are suing the congresswoman's campaign, America PAC, and others, alleging that they were promised hourly wages, then told pay would depend on how many doors they knocked.",
        "Elon Musk’s America PAC Hit With Class Action Lawsuit",
        "With bombs, brawls, and stolen mail-in ballots already in play, the 2024 election is shaping up to be exceptionally chaotic. WIRED is tracking these incidents as they unfold.",
        "Election Violence Is Already Here",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney",
        "Two friends launched a political action committee to run anti-Trump ads in perhaps the last untouched advertising market in politics: pornographic websites.",
        "Meet the Democrats using porn ads to convince Trump voters to stay home"
    ],
    "2024-10-15": [
        "After two people in the crowd fainted, Trump decided to turn his latest rally into a 'music fest.'",
        "Trump Spends 39 Minutes on Stage Listening to His Beloved Spotify Playlist",
        "A co-founder of World Liberty Financial, Trump’s decentralized finance platform, claimed more than 100,000 accredited investors signed up for the whitelist, but most haven’t bought the token.",
        "Trump’s crypto website crashed after its token went on sale"
    ],
    "2024-10-25": [
        "The billionaire has been chatting with Russia's authoritarian leader for years while he stumps for Trump and commands huge government contracts.",
        "With Putin Calls, It’s More Clear Than Ever That Elon Musk Is a National Security Threat",
        "Joe Biden's administration is investigating alleged Chinese efforts to hack US telecoms infrastructure amid reports hackers had targeted the phones of former president Donald Trump and his running mate JD Vance. Financial Times: The FBI and the Cybersecurity …",
        "FBI Investigates Claims China Tried To Hack Donald Trump's Phone"
    ],
    "2024-10-22": [
        "Trump's narcissism knows no bounds.",
        "Donald Trump’s iPhone Wallpaper Is Just a Photo of Himself",
        "Is the tech billionaire breaking the law? We may soon find out.",
        "Justice Department Says It Has Received Complaints About Elon Musk’s $1 Million Payments to Voters",
        "Joe Rogan's interview with Donald Trump would be the former president's latest appearance on a podcast that attracts young men.",
        "Trump scores a Joe Rogan interview for the first time, with an eye on male voters",
        "Startups offering medication abortions, contraception, and period-tracking apps are preparing for the risks of another Trump presidency.",
        "'The million-dollar question of this election': Women's health startups are confronting a shifting legal landscape",
        "The social media giant banned dozens of accounts that posting publicly available information, citing the harm they posed to celebrities.",
        "Meta Bans Accounts Tracking Private Jets of Celebs and Russian Oligarchs",
        "Harris and Trump are looking to firm up voters in their respective coalitions while also winning crossover support that could secure them victory.",
        "The election is still incredibly close with 2 weeks to go, with warning signs for both Trump and Harris in the Sun Belt"
    ],
    "2024-10-26": [
        "Trump discusses the “biggest mistake” of his presidency, what he told North Korea’s leader and life in space.",
        "Seven takeaways from Trump's interview with Joe Rogan",
        "The BBC's analysis editor examines what happened in 2020 and how the Republican might react if he were to lose again.",
        "Ros Atkins on… Would Donald Trump accept defeat?",
        "Mark Cuban told Business Insider that \"we all have friends\" like Donald Trump. He maintains that Trump would be a lousy president.",
        "Mark Cuban praises Trump's 'great personality' but stands by assertion that he was a 'lousy president'",
        "Russia's war in Ukraine is a major issue in the 2024 election. If Trump wins the White House, Ukraine's future is more uncertain than ever.",
        "What Trump's own words tell us about what a White House win could mean for Ukraine"
    ],
    "2024-10-18": [
        "The huge buy is further proof that predictive betting sites are only a reflection of what degenerate gamblers are willing to spend.",
        "$30 Million Is All It Took to Shift the Odds in Trump’s Favor on Polymarket",
        "The campaign pushes users to IWillVote.com to make sure they're registered.",
        "Dems Launch Taylor Swift Snapchat Filter to Target Young Voters for Kamala Harris",
        "An anonymous reader quotes a report from The Verge: Donald Trump said Apple CEO Tim Cook called him to discuss the billions of dollars that Apple has been fined in the European Union. Trump made the statement during his appearance on the PBD Podcast -- and sa…",
        "Trump Says Tim Cook Called Him To Complain About the EU",
        "The unsealing of the documents comes after Donald Trump failed in a final attempt to delay the release until after the presidential election.",
        "Trump judge releases 1,889 pages of additional election interference evidence against the former president"
    ],
    "2024-10-04": [
        "Allegations surrounding \"misuse of funds, hiring of foreign contractors and interfering with product development\" are flying.",
        "Trump Media Execs Reportedly Quit Amid Complaints About CEO Devin Nunes",
        "President Biden told reporters he was confident the election “will be free and fair,” before saying, “I don’t know whether it will be peaceful.”",
        "Biden says he is worried about violence around the presidential election",
        "Mark Cuban said during the \"All-In\" podcast that he tried to give Donald Trump a lot of advice for his 2016 campaign.",
        "Mark Cuban tells 'All-In' podcast that the advice he tried giving Trump went unheeded"
    ],
    "2024-10-08": [
        "Musk also claimed liberal states were \"making crime legal\" during an interview with Tucker Carlson.",
        "Elon Musk Says He Might Get Thrown in Jail If Trump Doesn’t Win",
        "In her new memoir, \"Melania,\" Melania Trump writes about her marriage to Donald Trump, where she was on January 6, and that infamous jacket.",
        "10 scandals Melania Trump addresses in her new memoir",
        "Trump writes more about protests outside the White House than the circumstances of Floyd's death.",
        "Melania Trump refers to George Floyd as only a 'Black Minneapolis resident' in her memoir",
        "A Trump campaign spokesman vigorously denied the claims in the new book, calling the author \"demented and deranged.\"",
        "Trump-Putin relationship: New book details secret COVID tests, up to 7 phone calls since 2021",
        "Former first lady Melania Trump in her new memoir questioned how Fox News was able to call Arizona for Biden \"so early\" on election night.",
        "Melania Trump says she 'couldn't believe it' when Arizona was called 'so early' for Biden in 2020"
    ],
    "2024-10-14": [
        "CalMatters and The Markup used Facebook’s AI model to count the millions of dollars it makes after violent news events.",
        "How Meta Brings in Millions Off of Political Violence",
        "The film, which has received mixed reviews, falls to third spot in its second week on the chart.",
        "Joker sequel suffers $33m collapse at box office"
    ],
    "2024-10-19": [
        "The new Donald Trump biopic, which opened in US theaters on October 11, sees Marvel star Sebastian Stan portray a young Trump.",
        "What the Trump biopic 'The Apprentice' got right, and what's fiction"
    ],
    "2024-10-11": [
        "Donald Trump's ascent in 1970s and 80s New York is quite a story. So is the backstory about the movie, which barely made it to theaters.",
        "Behind the scenes of the Trump movie Trump doesn't want you to see",
        "Barron Trump has spent his life between NYC, the White House, and Mar-a-Lago. Read on for the details of his personal and political life.",
        "Barron Trump: The childhood, political role, and personal life of the youngest Trump son",
        "One of the richest men in the world, Elon Musk is so all-in on Trump that he might start knocking on doors in Pennsylvania himself.",
        "Elon Musk may knock on doors for Trump in Pennsylvania, report says",
        "Also, who is playing Trump in a movie? Who's hitting the podcast circuit? Will any of this matter in 80,000 years? Plus: TWO questions about Nobel Prizes!",
        "What did Trump secretly send Putin, according to a new book? Find out in the quiz"
    ],
    "2024-10-17": [
        "US efforts to increase the production of semiconductor chips will continue under either a Harris and Trump presidency.",
        "America's chipmaking push will continue no matter who gets elected"
    ],
    "2024-10-05": [
        "Elon Musk was listed just below Donald Trump's family but above JD Vance in the campaign's list of attendees for Saturday's rally in Pennsylvania.",
        "Elon Musk says he will speak at Donald Trump's rally in Pennsylvania",
        "Ben Horowitz, cofounder of Andreessen Horowitz, showed support for the Trump campaign. An email to A16z employees shows his relationship with Harris.",
        "VC power player Ben Horowitz says he'll donate to Kamala Harris. Read the memo."
    ],
    "2024-10-13": [
        "Harris wants to make it easier for eligible voters to cast ballots and rebuild Voting Rights Act protections against racial discrimination, while Trump pushes for more restrictions to voting access.",
        "The stark divide between Harris and Trump on voting rights",
        "Harris sees Michigan, Pennsylvania, and Wisconsin as the keys to a November victory. But she remains locked in a tight race with Trump in each state.",
        "The blue wall battlegrounds will be won or lost on the economy. Here's where Harris stands in these critical states."
    ],
    "2024-10-12": [
        "The two-page letter says that Vice President Harris is in excellent health and has “the physical and mental resiliency required to successfully execute the duties of the presidency.”",
        "Harris releases medical report, drawing another contrast with Trump"
    ],
    "2024-10-09": [
        "The Kremlin seemingly confirmed reports that then-President Donald Trump sent COVID tests to Vladimir Putin in early 2020, for his own personal use.",
        "The Kremlin says Trump sent Putin COVID tests during the pandemic, but denies subsequent calls",
        "As Hurricane Milton barrels toward Florida, Harris and Trump are under new scrutiny over their disaster responses. Here's where they stand.",
        "Hurricanes are taking the election by storm. Here's where Harris and Trump stand on natural disaster policies."
    ],
    "2024-10-27": [
        "These counties will help tell the story of how either former President Donald Trump or Vice President Kamala Harris will become the next president.",
        "These swing-state counties are key to understanding the presidential race",
        "Vice President Harris has been campaigning with Republicans disaffected with former President Donald Trump. But some progressive voters aren’t loving the strategy.",
        "Harris is reaching out to Republicans. Some progressives feel left behind"
    ]
}