{
    "2024-10-10": [
        "The increasingly outspoken tech mogul spoke at a Trump rally this weekend in one of the most contested battleground states.",
        "Will Elon Musk Tip the Election for Trump?",
        "Donald Trump's daughter Tiffany Trump and her husband Michael Boulos got married at Mar-a-Lago in 2022.",
        "Tiffany Trump and Michael Boulos are expecting their first child. Here's a timeline of their relationship.",
        "Russian state media and right-wing influencers on X helped share disinformation about Disney.",
        "Fake Photos of Disney World Destroyed by Hurricane Milton Flood Social Media",
        "\"It's one that sets off alarm bells for me as a former member of the evangelical church.\"",
        "Donald Trump Uses 1 Word To Appeal To Female Voters. Here's Why It Should Scare You."
    ],
    "2024-10-16": [
        "Investors scooped up only a small number of the Trump family's new World Liberty Financial crypto tokens after website reliability issues interfered with a launch event.",
        "Trumpcoin Launches With a Whimper",
        "Rep. Thomas Massie of Kentucky also wrote his own name in for vice president. \"I do NOT recommend this,\" he wrote.",
        "House Republican spurns Trump and writes in Ron DeSantis for president — and himself for VP",
        "Elon Musk is giving a series of events in Pennsylvania this week. The Tesla and SpaceX CEO has donated more than $75 million to a pro-Trump super PAC.",
        "Elon Musk hits the campaign trail in a key swing state after donating $75 million to a pro-Trump super PAC",
        null,
        "Why are people leaving Trump rallies early? We asked them",
        "A judge temporarily blocked Alabama’s voter removal program after finding the state violated federal law by systematically purging voters too close to this fall’s election.",
        "A federal judge has ordered Alabama to stop purging voters before Election Day",
        "In his most direct answer yet of this election cycle, vice presidential nominee Sen. JD Vance said he doesn't believe former President Donald Trump lost the 2020 election",
        "Vance says 'no' Trump didn't lose the 2020 election",
        null,
        "JD Vance says Trump did not lose the 2020 US election"
    ],
    "2024-10-21": [
        "Donald Trump's opposition to “woke” safety standards for artificial intelligence would likely mean the dismantling of regulations that protect Americans from misinformation, discrimination, and worse.",
        "How a Trump Win Could Unleash Dangerous AI",
        "Elon Musk's private planes made eight flights to and from Pennsylvania this past week.",
        "Flight logs show Elon Musk's private jets are busy hitting swing states as he campaigns for Trump",
        "Donald Trump embraces a working-class fantasy.",
        "The Slop Candidate",
        "Members of the \"Central Park Five\" filed a defamation suit against Trump on Monday, accusing him of spreading \"false, misleading and defamatory\" statements.",
        "'Central Park 5' members sue Donald Trump over debate comments"
    ],
    "2024-10-31": [
        "A successful CIA hack of Venezuela's military payroll system, insider fights for spy agency resources, and messy opposition politics: A WIRED investigation reveals a secret Trump-era attempt to oust autocratic ruler Nicolás Maduro.",
        "The Untold Story of Trump's Failed Attempt to Overthrow Venezuela's President",
        "If you thought 2020 was bad, decisions from Big Tech and the US government have led to an internet that’s even worse off.",
        "Ahead of the Election, Social Media Platforms Have Given Up",
        "What a garbage heap.",
        "Scammy Ads on Facebook and Instagram Viewed 900 Million Times: Report",
        "Trump statues appeared next to sculptures of nude women in Portland and Philadelphia. The plaques bear the title In Honor of a Lifetime of Sexual Assault and quote Trump's Access Hollywood remarks.",
        "It's not just D.C.: Satirical Trump statues are appearing in cities across the U.S.",
        "Four years ago, Trump supporters, motivated in part by false election fraud claims, loudly protested at a Detroit counting facility. Election officials are determined to avoid a repeat of the chaos.",
        "After a chaotic vote count in 2020, here's what Detroit will do differently this year",
        null,
        "Trump Gets Shocking News From Double Whammy of Poll Results"
    ],
    "2024-10-30": [
        "America PAC door knockers were flown to Michigan, driven in the back of a U-Haul, and told they’d have to pay hotel bills unless they met unrealistic quotas. One was surprised they were working to elect Donald Trump.",
        "Workers Say They Were Tricked and Threatened as Part of Elon Musk’s Get-Out-the-Vote Effort",
        "\"We're rooting for him — obviously, we're proud of him. But, you know, either way, our life will just continue to move forward,\" Kushner said of Trump.",
        "One week out from the election, Jared Kushner and Ivanka Trump still say they're set on moving on from Trumpworld",
        "New York Times reporter Ken Bensinger says the America First Policy Institute, which has nearly 300 executive orders ready to be signed, would influence a Trump second term more than Project 2025.",
        "How a little-known organization is poised to shape a second Trump administration",
        "On the anniversary of President Biden's executive order on AI, the White House says it has met all its year-one goals.",
        "The Biden Administration Touts Its Big Year in AI"
    ],
    "2024-10-07": [
        "Two photos from the event where Musk stumped for Trump became iconic fodder for the internet.",
        "Elon Musk Leaps Into the Meme History Books at Trump Rally",
        "There were no generic alternatives to a lifesaving drug when Shkreli jacked up its price by more than $700 per pill in 2015.",
        "Supreme Court Snubs Martin Shkreli’s Last-Ditch Bid to Avoid $64 Million Fine"
    ],
    "2024-10-15": [
        "After two people in the crowd fainted, Trump decided to turn his latest rally into a 'music fest.'",
        "Trump Spends 39 Minutes on Stage Listening to His Beloved Spotify Playlist",
        "A co-founder of World Liberty Financial, Trump’s decentralized finance platform, claimed more than 100,000 accredited investors signed up for the whitelist, but most haven’t bought the token.",
        "Trump’s crypto website crashed after its token went on sale",
        "Donald Trump, asked if Google should be broken up, said the US wants to \"have great companies\" and \"China is afraid of Google.\"",
        "Trump says Google has 'a lot of power' and he would do 'something' about it — but stops short of favoring a break-up",
        "During a Philadelphia town hall, Donald Trump was twice interrupted by medical emergencies in the room.",
        "Trump’s Pennsylvania Town Hall Turns Into Impromptu Concert After Medical Incidents",
        "Donald Trump has admitted a shocking truth about his relationship with Russian leader Vladimir Putin since leaving the White House.",
        "Trump Confesses to Startling Putin Ties in Trainwreck Interview",
        "Former President Donald Trump's town hall in Oaks, Pennsylvania, on Monday evening was interrupted twice by medical emergencies.",
        "Trump town hall derailed after medical emergencies in the crowd"
    ],
    "2024-10-25": [
        "The billionaire has been chatting with Russia's authoritarian leader for years while he stumps for Trump and commands huge government contracts.",
        "With Putin Calls, It’s More Clear Than Ever That Elon Musk Is a National Security Threat",
        "ABC News was first to obtain a copy of the report secured by American Oversight.",
        "Redacted Trump-Arlington cemetery incident report suggests investigation ongoing"
    ],
    "2024-10-26": [
        "The BBC's analysis editor examines what happened in 2020 and how the Republican might react if he were to lose again.",
        "Ros Atkins on… Would Donald Trump accept defeat?",
        "\"The negative narrative was proven to be 100% wrong,\" Global Equities analyst Trip Chowdhry said of worry over Elon Musk's support for Donald Trump.",
        "Tesla ends the week on a high fueled by earnings 'surprise'"
    ],
    "2024-11-01": [
        "Canvassers for California representative Michelle Steel are suing the congresswoman's campaign, America PAC, and others, alleging that they were promised hourly wages, then told pay would depend on how many doors they knocked.",
        "Elon Musk’s America PAC Hit With Class Action Lawsuit",
        null,
        "Critics Trash Donald Trump Jr. And Eric Trump For 'On The Nose' Halloween Costumes"
    ],
    "2024-10-28": [
        "The lawsuit is the first official legal action against the billionaire's election lottery scheme.",
        "Musk Screams at Trump Rally as Philly DA Sues to Stop $1 Million Voter Giveaway",
        "A government memo viewed by WIRED states that insider threats “could derail or jeopardize a fair and transparent election process.”",
        "US Intel Says Insider Threats Are 'Likely' During the Election",
        "Experts cast doubt on whether the lost revenue could be replaced with tariffs.",
        "Trump proposes eliminating personal income taxes. How would that work?"
    ],
    "2024-10-04": [
        "Allegations surrounding \"misuse of funds, hiring of foreign contractors and interfering with product development\" are flying.",
        "Trump Media Execs Reportedly Quit Amid Complaints About CEO Devin Nunes",
        "If this was a typical company, the departure of its COO and allegations of a whistleblower complaint would be a big deal.",
        "Donald Trump's social media company has new worries and investors don't care",
        null,
        "Gullible Trump Cronies Losing Their Minds Over Fake AI Slop on Twitter"
    ],
    "2024-10-23": [
        "Another legal issue to toss into the pile that he'll just ignore.",
        "Justice Department Warns Elon Musk That His $1 Million Voter Giveaway Might Be Illegal",
        "Trump's former chief of staff John Kelly confirmed previous reports that Trump told him Hitler \"did some good things,\" The New York Times reported.",
        "John Kelly says Trump told him more than once that Hitler 'did some good things'",
        "Musk previously said he would be enthusiastic to take on a White House role centered on enforcing government efficiency should Donald Trump win.",
        "Elon Musk said he'd push to regulate autonomous driving on the federal level 'if there's a department of government efficiency'",
        "A report from the US Department of Homeland Security claims that self-identified militia members have posted the names and photos of US government officials in reaction to their work on the US-Mexico border.",
        "Judges and Border Police Targeted by Anti-Government Extremists, Doxed as 'Traitors'",
        "The Trump campaign denies any altercation with a cemetery employee.",
        "DOD ordered to turn over records from Trump's Arlington National Cemetery incident",
        "Ancient Slashdot reader szo shares a report from Phoronix: Quietly merged into this week's Linux 6.12-rc4 kernel was a patch that removes a number of kernel maintainers from being noted in the official MAINTAINERS file that recognizes all of the driver and su…",
        "Linus Torvalds Comments On The Russian Linux Maintainers Being Delisted",
        "The 15 recordings, some of which capture the sounds of chaos in the background, were released Wednesday by Butler County officials.",
        "911 calls from Trump assassination attempt in Butler County released",
        "Donald Trump’s former chief of staff and retired General John Kelly called the former president a “fascist” with no concept for the rule of law or constitution.",
        "WATCH: Trump blasted by former chief of staff",
        null,
        "Barack Obama Trolls Trump With A 'Little' Reminder That's Bound To Get Under His Skin"
    ],
    "2024-10-08": [
        "In her new memoir, \"Melania,\" Melania Trump writes about her marriage to Donald Trump, where she was on January 6, and that infamous jacket.",
        "10 scandals Melania Trump addresses in her new memoir",
        "Trump writes more about protests outside the White House than the circumstances of Floyd's death.",
        "Melania Trump refers to George Floyd as only a 'Black Minneapolis resident' in her memoir",
        "A Trump campaign spokesman vigorously denied the claims in the new book, calling the author \"demented and deranged.\"",
        "Trump-Putin relationship: New book details secret COVID tests, up to 7 phone calls since 2021",
        "Former first lady Melania Trump in her new memoir questioned how Fox News was able to call Arizona for Biden \"so early\" on election night.",
        "Melania Trump says she 'couldn't believe it' when Arizona was called 'so early' for Biden in 2020",
        "In her new memoir, Melania Trump says that Obamas didn't adequately respond to her requests to access the White House and begin renovations.",
        "Melania Trump says the Obamas didn't give her enough time to renovate the White House",
        "Fourteen states filed separate lawsuits Tuesday alleging TikTok harms children's mental health. Only New York has Kevin Wallace.",
        "Lawyer who twice grilled Trump in NY fraud case now helps lead a 14-state war on 'addictive' TikTok",
        "Former President Trump is disputing a report that, during the COVID-19 pandemic, he secretly sent Vladimir Putin a COVID-19 testing kit for his personal use.",
        "Trump disputes report that, as president, he secretly sent Putin COVID-19 testing kit"
    ],
    "2024-10-19": [
        "The new Donald Trump biopic, which opened in US theaters on October 11, sees Marvel star Sebastian Stan portray a young Trump.",
        "What the Trump biopic 'The Apprentice' got right, and what's fiction",
        "If the former president's first term is any indication, he's not bluffing when he threatens drastic action against Americans who oppose him",
        "Trump’s Closing Pitch to Voters: I Will Let You Die If You Don’t Bow to My Demands",
        "Why is Elon Musk really all in for Trump? The mogul has long dreamed of redesigning the world to achieve his techno-authoritarian dreams. As @FranklinFoer writes, Trump is just the perfect Trojan horse:",
        "What Elon Musk Really Wants",
        "Colin Allred, Texas Democratic candidate for Senate, talks with Ali Velshi about why his tight races against Ted Cruz could be the one to flip that seat blue...",
        "Echoing anti-Trump trend, some Texas Republicans flip to Allred over Cruz"
    ],
    "2024-10-24": [
        "Ivanka Trump stepped back from politics when Donald Trump launched his 2024 campaign and has largely returned to her previous life as a socialite.",
        "Ivanka Trump has been absent from the 2024 campaign trail. Here's what she's been up to.",
        "Florida’s Attorney General is asking a federal judge to allow the state to prosecute Ryan Routh, the man accused of attempting to assassinate former President Donald Trump at his golf club.",
        "Florida fighting with the U.S. Justice Department over prosecuting Ryan Routh",
        "Zelenskyy ditched his iconic green T-shirt to send a pointed message to Russia on Wednesday, gaining an ascerbic response from the Kremlin.",
        "Zelenskyy's new T-shirt riffs on Trump — and annoyed the Kremlin"
    ],
    "2024-10-22": [
        "Is the tech billionaire breaking the law? We may soon find out.",
        "Justice Department Says It Has Received Complaints About Elon Musk’s $1 Million Payments to Voters",
        "The social media giant banned dozens of accounts that posting publicly available information, citing the harm they posed to celebrities.",
        "Meta Bans Accounts Tracking Private Jets of Celebs and Russian Oligarchs",
        "Kenneth Valentine served in the US Secret Service for 24 years.  He discusses the assassination attempts on former President Donald Trump.",
        "How the Secret Service actually works, according to a former special agent",
        "New Yorker writer Susan Glasser says Trump is highly transactional, so billionaires may be betting on access and a seat at the table if he’s re-elected. It’s what some of them got in his first term.",
        "What do Elon Musk and other billionaires want in return for backing Trump?",
        null,
        "Trump Gets Surprising News on His Performance From a Shocking Poll",
        null,
        "Elon Musk’s pro-Trump Pac pouring millions into Facebook ads instead of X"
    ],
    "2024-10-11": [
        "Donald Trump's ascent in 1970s and 80s New York is quite a story. So is the backstory about the movie, which barely made it to theaters.",
        "Behind the scenes of the Trump movie Trump doesn't want you to see",
        "Barron Trump has spent his life between NYC, the White House, and Mar-a-Lago. Read on for the details of his personal and political life.",
        "Barron Trump: The childhood, political role, and personal life of the youngest Trump son",
        "Also, who is playing Trump in a movie? Who's hitting the podcast circuit? Will any of this matter in 80,000 years? Plus: TWO questions about Nobel Prizes!",
        "What did Trump secretly send Putin, according to a new book? Find out in the quiz",
        "During his remarks given to the Detroit Economic Club, Trump said he found autonomous vehicles \"concerning\" and promised to \"stop\" them.",
        "Elon Musk might have to convince Trump not to 'stop' autonomous vehicles if he's reelected",
        "The billionaire has made these kinds of promises before. Many times.",
        "Elon Musk Hilariously Claims Tesla Cybercab Will Be Available In 2-3 Years",
        null,
        "Donald Trump, Yesterday, on Autonomous Cars",
        "“The Apprentice” aims to avoid politics—and ends up with a shallow, murky portrait.",
        "The Trap of Making a Trump Biopic"
    ],
    "2024-10-14": [
        "The film, which has received mixed reviews, falls to third spot in its second week on the chart.",
        "Joker sequel suffers $33m collapse at box office"
    ],
    "2024-10-18": [
        "An anonymous reader quotes a report from The Verge: Donald Trump said Apple CEO Tim Cook called him to discuss the billions of dollars that Apple has been fined in the European Union. Trump made the statement during his appearance on the PBD Podcast -- and sa…",
        "Trump Says Tim Cook Called Him To Complain About the EU",
        "The unsealing of the documents comes after Donald Trump failed in a final attempt to delay the release until after the presidential election.",
        "Trump judge releases 1,889 pages of additional election interference evidence against the former president",
        "When pollsters failed to see the surge of support for Donald Trump in 2016 and 2020, it seemed like a low point for the political survey industry.",
        "How election polls are actually getting better",
        "“I think that encapsulates a lot,” Stephen Colbert agreed with the famed journalist.",
        "Bob Woodward Nails Alarming Donald Trump Trait That Cost Him 2020 Election ‘Landslide’"
    ],
    "2024-10-09": [
        "The Kremlin seemingly confirmed reports that then-President Donald Trump sent COVID tests to Vladimir Putin in early 2020, for his own personal use.",
        "The Kremlin says Trump sent Putin COVID tests during the pandemic, but denies subsequent calls",
        null,
        "Idiot Trump Accidentally Debunks Himself at Pennsylvania Rally",
        "Trump's proposed tariffs could hurt lower earners' wallets, while extending the former president's signature tax cuts would benefit those at the top.",
        "The top 5% will benefit from Trump's tax plans while the rest of America pays more, a new analysis says",
        "\"No, it's not like that,\" Kremlin spokesperson Dmitry Peskov told a reporter for a Russian news outlet on Wednesday.",
        "Kremlin denies report of Putin phone calls with Trump",
        "Donald Trump is the tyrant the first president feared.",
        "Washington’s Nightmare"
    ],
    "2024-10-29": [
        "Blackstone CEO Steve Schwarzman and Citadel's Ken Griffin weighed in on the election during a panel at Saudi Arabia's Future Investment Initiative.",
        "Steve Schwarzman says Trump would be an 'efficient and effective' president this time — and Ken Griffin thinks he'll win",
        "GOP megadonor Miriam Adelson is the widow of businessman Sheldon Adelson. Take a closer look at her wealth and political leanings.",
        "Meet Miriam Adelson, the billionaire GOP donor who's given $100 million to support Donald Trump's campaign"
    ],
    "2024-10-13": [
        "Shotgun, handgun and magazines were found in car of man arrested on Saturday, according to authorities",
        "Man with guns arrested near Trump rally in Coachella, sheriff says",
        "A group with close ties to Donald Trump is presumed to have been attacked by Chinese hackers.",
        "Group with close ties to Trump presumed to have been attacked by Chinese hackers"
    ],
    "2024-10-17": [
        "The European Union is making a decision that may cause any potential fines against Musk to skyrocket.",
        "The EU’s Fines Against Elon Musk May Be Much Larger Than Anticipated",
        null,
        "\"Not able to run for two weeks\": Trump cancels NRA rally appearance amid decline concerns"
    ],
    "2024-10-27": [
        "Jake Tapper couldn’t hold back his laughter after Republican vice presidential candidate JD Vance revealed a new theory about why several big-name...",
        "JD Vance’s Latest Trump Line Left Jake Tapper Laughing During Brutal CNN Interview"
    ],
    "2024-10-20": [
        "Golf icon Arnold Palmer was “appalled” by former president Donald Trump, who weirdly started boasting about Palmer’s genitals at a campaign rally Saturday...",
        "Arnold Palmer Was ‘Appalled’ by ‘Crude’ Trump, Who Praised the Late Golfer’s Genitals"
    ],
    "2024-10-12": [
        null,
        "Crowd members hold up white supremacist group's slogan at Trump/Vance event"
    ]
}