{
    "2024-10-24": [
        "The Trump and Harris campaigns have built huge networks of influencers and content creators. They have one last job—getting people out to vote.",
        "Influencers Get Their Final Marching Orders for the Election",
        "Guerrero said that possible opportunities would be jumping on a campaign bus touring Las Vegas and speaking to voters about reproductive rights or to go door-knocking in battleground states. It sound… [+2575 chars]",
        "Yvette Cooper announces funding as part of a \"fundamental reset\" of the Windrush scandal response.",
        "Victims concerned over missing Windrush reform",
        "Windrush campaigners have expressed concern that the home secretary has yet to announce when she will implement a key recommendation from the governments review.\r\nOn Thursday, Yvette Cooper announced… [+3526 chars]",
        "Reeves has said the government will change these rules to free up billions for spending on big projects.",
        "Chancellor to change debt rules to release billions for infrastructure spending",
        "The government will change its self-imposed debt rules in order to free up billions for infrastructure spending, the chancellor has told the BBC.\r\nChancellor Rachel Reeves said that there will be a t… [+1859 chars]",
        "Vice President Harris will have a special guest at her rally in Houston on Friday: Beyonce.",
        "BeyHive meets KHive: Beyonce set to perform at Houston rally for Harris",
        "A key part of the soundtrack of Vice President Harris' race for the Oval Office has been Beyoncé's anthem \"Freedom.\"\r\nBut on Friday, Queen Bey herself is set to make an appearance on the campaign tra… [+1042 chars]",
        "Conservative Man Proudly Frightened Of Everything. “I’m scared of books. I’m scared of movies. I’m scared",
        "Conservative Man Proudly Frightened Of Everything. “I’m scared of books. I’m scared...",
        "×Hello! In order to leave a comment, you need to be a current kottke.org member. If you'd like to sign up for a membership to support the site and join the conversation, you can explore your options … [+394 chars]"
    ],
    "2024-10-21": [
        "Both liberal and conservative lawyers have judge-shopped, but in recent years, some conservative-leaning groups have been laser focused on bringing their challenges  in the Fifth Circuit Court of Appeals.",
        "A frustrated Supreme Court to look at one version of judge shopping",
        "The Supreme Court said Monday it would weigh in on at least one version of what is derisively called judge shopping. That is the phenomenon of plaintiffs going to great lengths to file cases with jud… [+2307 chars]",
        "The emails, sent while she was attorney general, could amount to a breach of the ministerial code.",
        "Braverman sent government documents to private email 127 times",
        "Suella Braverman forwarded government documents to her private email accounts at least 127 times while she was attorney general in a potential breach of the ministerial code, it has emerged.\r\nThe rev… [+2198 chars]",
        "Donald Trump's opposition to “woke” safety standards for artificial intelligence would likely mean the dismantling of regulations that protect Americans from misinformation, discrimination, and worse.",
        "How a Trump Win Could Unleash Dangerous AI",
        "The reporting requirements are essential for alerting the government to potentially dangerous new capabilities in increasingly powerful AI models, says a US government official who works on AI issues… [+3559 chars]",
        "The revelation comes after Kemi Badenoch said she would give Rowling a peerage for her stance on gender.",
        "JK Rowling turned down House of Lords peerage twice",
        "JK Rowling has revealed she turned down two offers of a peerage in the House of Lords and would turn down a third. \r\nThe author's remarks came after Conservative Party leader hopeful Kemi Badenoch sa… [+2393 chars]",
        "The court left in place a 90-year old landmark decision that declared that presidents cannot fire members of a multi-member independent agency, except in cases of bad behavior.",
        "Supreme Court declines challenge to CPSC's structure, for now",
        "The Supreme Court has declined, for now, to hear the latest attack on the so-called administrative state. On Monday it left in place a 90-year old landmark decision that declared that presidents cann… [+1262 chars]",
        "The pouches have become a cause célèbre among anti-regulation conservatives, and a growing number of middle and high school students are using them.",
        "Kids Are Ditching Cigarettes and Using Nicotine Pouches Instead",
        "A new survey indicates tobacco use has hit its lowest point among middle and high school students in 25 years, but there is a troubling trend on the rise.\r\nE-cigarette usage declined among kids, as d… [+4300 chars]"
    ],
    "2024-10-25": [
        "Few parts of the country better illustrate the challenges either Kemi Badenoch or Robert Jenrick will face.",
        "Why the next Tory leader needs to go Cornish",
        "The Conservatives won every seat in Cornwall at the 2015 election\r\nNext Saturday we will finally find out who the Conservatives have chosen as their next party leader - and the leader of the UK gover… [+5717 chars]",
        "Blank is joining an initiative to woo more conservative, business-minded voters. Mark Cuban and Reid Hoffman are among industry titans also involved.",
        "Arthur Blank joins 'Business Leaders for Harris' as his former business partner funnels money to Trump",
        "Blank joins Mark Cuban, Reid Hoffman, and other business titans in their effort to woo more conservative voters.Jonathan Bachman/Getty Images\r\n<ul><li>Home Depot cofounder and billionaire Arthur Blan… [+2775 chars]",
        "A conservative appeals court sided with Republicans in ruling against a Mississippi law that allows election officials to count mail ballots that are postmarked by Election Day but arrive after it.",
        "Appeals court strikes a Mississippi law that provided a grace period for mail ballots",
        "A conservative U.S. appeals court has sided with Republicans in ruling against a Mississippi law that allows election officials to count mail ballots that are postmarked by Election Day but arrive af… [+4741 chars]",
        "Is the former conservative congresswoman’s effort to persuade Republican-leaning women to reject Trump a bold gambit or a Hail Mary?",
        "The Liz Cheney Theory of a Harris Victory",
        "A few years ago, all of this would have been extremely weird. Actually, as the Democrats around me in the theater stood to applaud Liz Cheney—the pro-life, ultraconservative daughter of Dick—it still… [+12957 chars]",
        "The industry challenge to the FTC click-to-cancel rule is in the Fifth Circuit, where conservative activists know to file their grievances.",
        "5th Circuit Can't Wait to Lock You into Scammy Subscriptions for a Little Longer",
        "The pro-ripping-you-off coalition is one of many business-adjacent litigants in recent years who understand that the Fifth Circuit offers them a robust homecourt advantage. The gun industry challenge… [+2068 chars]",
        "Newspaper endorsements don't matter much, it's the principle of management stopping them that matters.",
        "Jeff Bezos Reportedly Stops Washington Post From Making a Presidential Endorsement",
        "The Washington Post won’t make an endorsement for president this year. Ben Mullin from the New York Times first reported the news, which was confirmed by CEO Will Lewis shortly thereafter.\r\nThe annou… [+4594 chars]",
        "The government is warned of a \"foot-and-mouth\" level crisis over potentially diseased meat flooding into the UK.",
        "Action demanded over surge in illegal meat imports",
        "The government is under pressure to stop illegal meat being smuggled into the UK, amid warnings of a \"foot-and-mouth\" level crisis for British farmers.\r\nThe amount of meat seized by Border Force offi… [+5292 chars]"
    ],
    "2024-10-29": [
        "Vice President Kamala Harris is taking on former President Donald Trump. The election will determine the future of everything from electric cars to the entire legal system to to our democracy itself.",
        "The Verge’s guide to the 2024 presidential election",
        "A presidential campaign is an expression of ideology, often vocalized as a number of promises. Sometimes, those promises are made even when theyre outside the scope of what a president can enact. Wit… [+1159 chars]",
        "Robert Jenrick speaks to BBC Radio Kent ahead of Saturday’s leadership contest result.",
        "'I would end small boat crossings in weeks' - Jenrick",
        "The Conservative leadership candidate said he would stop the crossings in weeks if he was prime minister\r\nConservative leadership candidate Robert Jenrick has claimed that if he was prime minister he… [+3100 chars]",
        "David D. Kirkpatrick on the politicization of the murders of Laken Riley and other native-born white woman who have become tools in the conservative media against the Biden-Harris Administration.",
        "Will Laken Riley’s Murder Tip Georgia?",
        "At a rally in Duluth, Georgia, during the final days of the Presidential race, Donald Trump screened a video, set to the pulsing minor-key soundtrack to a horror movie, depicting what he portrayed as… [+14241 chars]",
        "Blackstone CEO Steve Schwarzman and Citadel's Ken Griffin weighed in on the election during a panel at Saudi Arabia's Future Investment Initiative.",
        "Steve Schwarzman says Trump would be an 'efficient and effective' president this time — and Ken Griffin thinks he'll win",
        "Blackstone CEO Steve Schwarzman announced his endorsement of Trump in May. Jim Watson/AFP/Getty Images\r\n<ul><li>Blackstone CEO Steve Schwarzman said he thinks Trump would make a better president the … [+2269 chars]",
        "Katherine Amess claims authorities had failed to adequately protect her father who was killed in 2021.",
        "We need answers, say family of murdered MP David Amess",
        "\"We have a lot of questions, and somebody needs to answer them,\" the daughter of murdered Conservative MP Sir David Amess has said.\r\nKatie Amess told the BBC Radio 4 Today programme that the authorit… [+4963 chars]",
        "US network says it has 'zero room for racism' after Girdusky tells Hasan: 'I hope your beeper doesn't go off.'",
        "CNN bans conservative commentator after verbal attack on Mehdi Hasan",
        "CNN has banned a conservative commentator after he verbally attacked British-American journalist Mehdi Hasan by referring to a series of exploding handheld devices in Lebanon that targeted Hezbollah.… [+3061 chars]",
        "CNN has banned a conservative commentator from the network after he targeted journalist Mehdi Hasan.",
        "CNN bans panellist Ryan Girdusky who verbally attacked Mehdi Hasan",
        "NewsFeed\r\nI hope your beeper doesnt go off. CNN has banned a conservative commentator from the network after he targeted journalist Mehdi Hasan with what he called a joke suggesting Hasan was a membe… [+14 chars]"
    ],
    "2024-10-23": [
        "Environment minister Daniel Zeichner welcomes a formal application to protect the Cockney favourite.",
        "Ministers back plans to enhance pie 'n' mash status",
        "A Conservative MP wants the Government to give pie 'n' mash protected status \r\nMinisters have backed a motion to give pie 'n' mash special protected status, just like Scottish salmon and Welsh lamb.\r… [+2300 chars]",
        "A document produced by the government says the mandate to strike could be extended to a year from six months.",
        "Government mulls giving workers twice as long to strike",
        "The government is considering giving workers twice as long to strike.\r\nUnder existing legislation, if workers vote to take industrial action, the mandate expires after six months and unions are requi… [+3046 chars]",
        "Despite reports of internal rifts all government departments have agreed spending settlements, Reeves says.",
        "Budget deals struck with all departments, says Reeves",
        "Chancellor Rachel Reeves says she has now reached spending settlements with all government departments ahead of her much-anticipated Budget on 30 October.\r\nIt comes after reports of Treasury rows wit… [+4831 chars]",
        "Eluned Morgan is keen to see investment in the English NHS, which would mean more for Wales as well.",
        "FM pushes for significant NHS cash boost in budget",
        "Wales' First Minister Eluned Morgan has called on the UK government to announce NHS investment in its Autumn Budget\r\nThe first minister of Wales has pushed for a \"significant\" boost to NHS finances t… [+2394 chars]",
        "Trump has previously called real videos of himself doing something embarrassing \"fake\" or AI.",
        "Why Are Trump Supporters Suddenly Freaked Out About Deepfakes?",
        "Right-wing influencers took to social media Tuesday and Wednesday to warn about future deepfakes that could emerge of Donald Trump. And all of the chatter has caused people to become very suspicious … [+5200 chars]"
    ],
    "2024-10-04": [
        "A group of business leaders are launching a new podcast in a bid to convince economy-minded swing voters to back Kamala Harris.",
        "Mark Cuban and other business titans are trying to woo conservative-leaning swing voters to support Kamala Harris",
        "Mark Cuban is among the group of business titans launching a new initiative to support Kamala Harris.Kevork Djansezian and Win McNamee/Getty Images\r\n<ul><li>A group of founders and CEOs are launching… [+2836 chars]",
        "The conservative justices do not care a whit what you think.",
        "The Key to Understanding This Supreme Court Term Is Neil Gorsuch’s Summer Calendar",
        "This article was published in partnership with Balls and Strikes.\r\nDuring their summer vacations, Ketanji Brown Jackson and Neil Gorsuch did what all Supreme Court justices do every few years when th… [+8661 chars]",
        "Christopher Berry and former parliamentary researcher Christopher Cash appeared at the Old Bailey on Friday.",
        "Two men deny spying for China",
        "Two men accused of spying for China pleaded not guilty at the Old Bailey on Friday. \r\nChristopher Berry, 32, and Christopher Cash, a 29-year-old former parliamentary researcher, have been charged und… [+1064 chars]",
        "Sir Keir Starmer says carbon capture clusters on Merseyside and Teesside will reignite industrial heartlands.",
        "Nearly £22bn pledged for carbon capture projects",
        "Ed Miliband, Rachel Reeves and Keir Starmer visit Teesside earlier this year, where one of the promised clusters will be stationed.\r\nThe government has pledged nearly £22bn for projects to capture an… [+3757 chars]",
        "Allegations surrounding \"misuse of funds, hiring of foreign contractors and interfering with product development\" are flying.",
        "Trump Media Execs Reportedly Quit Amid Complaints About CEO Devin Nunes",
        "At least four employees at Donald Trump’s media company Trump Media &amp; Technology Group, which owns Truth Social, have left the company recently according to a new report from ProPublica, The news… [+4426 chars]",
        "A Pennsylvania school district has reversed course and boarded up window openings it recently installed that allowed people in a middle school hallway to...",
        "Pennsylvania school boards up window openings that allowed views into its gender-neutral bathrooms",
        "A Pennsylvania school district has reversed course and boarded up window openings it recently installed that allowed people in a middle school hallway to peer into two gender-neutral-designated bathr… [+4737 chars]",
        "Will the plan announced today make a difference to the planet and is it worth the huge price tag?",
        "Will carbon capture help the UK tackle climate change?",
        "There is a lot of rousing rhetoric today about carbon capture, following the governments pledge of £21.7bn of public funds over the next 25 years to help kick-start the industry in the UK.\r\nIt says i… [+4550 chars]"
    ],
    "2024-10-28": [
        "Some of the most powerful people in Silicon Valley appear to be quietly sitting out the presidential election cycle. But Trump says that in private, it's a different story.",
        "A Running List of the Tech CEOs Donald Trump Claims Are Calling Him to Suck Up",
        "With only a few days left until the US presidential election, Donald Trump is claiming that some of Silicon Valleys most powerful billionaires and tech leaders are seeking him out.\r\nMany of these lea… [+2154 chars]",
        "The Tory leadership frontrunner admits she may need to \"calibrate\" her approach, see by some as combative.",
        "Badenoch says she may need a softer approach",
        "Conservative leadership contender Kemi Badenoch has said she will tone down her approach after some of her colleagues suggested she can be rude.\r\nBadenoch is widely seen as the favourite to replace R… [+2346 chars]",
        "Social Democrats won 52 seats in the 141-seat parliament, ending the four-year rule of the conservative Homeland Union government.",
        "Social Democrats Win Lithuania’s Election, Overcoming Center-Right Government",
        "VILNIUS, Lithuania Lithuania' s center-left opposition parties celebrated victory on Monday after prevailing over the center-right ruling coalition in the final round of national elections.\r\nWith 100… [+2939 chars]",
        "The former chancellor says the publication of a review which could criticise the Conservatives on Budget day would \"cross a line\".",
        "Hunt claims Budget watchdog will 'break impartiality' to aid tax rises",
        "A row has broken out between the UK's financial watchdog and former Conservative chancellor Jeremy Hunt over a review into the so-called £22bn \"black hole\" in the public finances Labour claims it has… [+2879 chars]",
        "The next president will face decisions on drug price negotiations, enhanced subsidies for Affordable Care Act plans and medication abortion among other issues. Here's where the candidates stand.",
        "Here's where Harris and Trump stand on three big health care issues",
        "As the 2024 election heads into its final weeks, the direction of policies affecting the health of millions of Americans is at stake.\r\nThe next president and Congress will have the power to put their… [+9098 chars]",
        "Marc Maron rebuked the comics driving the 'anti-woke flank' of the conservative movement after Tony Hinchcliffe's controversial set at a Trump rally.",
        "Marc Maron Slams Comics Driving ‘Anti-Woke Flank of the New Fascism’ After Tony Hinchcliffe Set",
        "Marc Maron rebuked the comics he believes are driving the “anti-woke flank of the new fascism” in a short essay pointedly shared after comedian Tony Hinchcliffemade several racist jokes at Donald Tru… [+1895 chars]"
    ],
    "2024-10-27": [
        "Bridget Phillipson refused to say if a small business owner was a \"working person\" in an interview with the BBC, ahead of Wednesday's Budget.",
        "No tax rises in payslips for 'working people', vows minister",
        "Education Secretary Bridget Phillipson has said \"working people\" would not see higher taxes on their payslips following Wednesday's Budget.\r\nDuring the election, Labour promised not to increase taxes… [+2334 chars]",
        "But Bridget Phillipson told the BBC that legislation would not be introduced \"any time soon\".",
        "Education secretary 'open minded' on England smacking ban",
        "The education secretary has said she is \"open minded\" to a ban on smacking children in England, but that there are no imminent plans to change the law.\r\nIt comes after fresh calls for a ban in Englan… [+2630 chars]",
        "Towns and cities call on the Labour government to deliver the funds promised for vital regeneration.",
        "Billions of levelling-up cash in limbo",
        "Prime Minister Sir Keir Starmer says he wants levelling up to be more than a slogan\r\nSome of the most deprived areas of the West Midlands fear they could lose millions in levelling-up money promised … [+4273 chars]",
        "Jake Tapper couldn’t hold back his laughter after Republican vice presidential candidate JD Vance revealed a new theory about why several big-name...",
        "JD Vance’s Latest Trump Line Left Jake Tapper Laughing During Brutal CNN Interview",
        "Jake Tapper laughs in JD Vance's face on CNN's State of the Union With Jake Tapper and Dana Bash.\r\nJake Tapper couldnt hold back his laughter after Republican vice presidential candidate JD Vance rev… [+1505 chars]"
    ],
    "2024-10-15": [
        "The roads’ choreographed demolition underlines North Korea’s growing anger against South Korea’s conservative government.",
        "North Korea Blows Up Parts of Inter-Korean Roads in Symbolic Display of Anger",
        "SEOUL, South Korea In a symbolic display of anger, North Korea on Tuesday blew up the northern section of unused roads that once linked it with the South, with the rivals exchanging threats days afte… [+4180 chars]",
        "From Arnold Schwarzenegger to \"Fuller House\" star Candace Cameron Bure, here's a list of celebrities who have spoken about their Republican values.",
        "15 celebrities who are outspoken Republicans",
        "The actors Melissa Joan Hart and Candace Cameron Bure have both spoken about having conservative values.Billboard/Contributor/Getty Images ; Olivia Wong/WireImage/Getty Images\r\n<ul>\n<li>Some celebrit… [+10553 chars]",
        "A law to ban smartphones in schools will be called for under a private member’s bill on Wednesday.",
        "Fight begins to make mobile-free schools law",
        "Calls are growing to ban smartphones in schools in England by law, as education experts and unions back an MPs attempt to push a new law through Parliament.\r\nChildren doomscrolling for hours a day is… [+4958 chars]"
    ],
    "2024-11-01": [
        "BBC political editor Chris Mason gives the run down on how the Tory Party leadership result could play out.",
        "Badenoch is favourite, but will she clinch Tory leadership crown?",
        "Famously, it is the hardest job in politics: leader of the opposition.\r\nAnd it is particularly hard if your party has just gone down to a historically bad thrashing at the hands of the electorate.\r\nA… [+4289 chars]",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney",
        "Former President Donald Trump lashed out against former GOP Rep. Liz Cheney in Arizona on Thursday, using violent language and insults to describe the most prominent Republican supporter of his oppon… [+1786 chars]",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney",
        "Former President Donald Trump lashed out against former GOP Rep. Liz Cheney in Arizona on Thursday, using violent language and insults to describe the most prominent Republican supporter of his oppon… [+1675 chars]",
        "Conservative Christians, notably evangelicals, are key Republican voters, but some are breaking with party on Israel.",
        "Conservative Christians, Israel and the US vote",
        "Trump and the Republican party continue to connect with several segments of Christian voters, a diverse group of denominations that spans racial identities and political perspectives.\r\nA Pew Research… [+3432 chars]",
        "Either Kemi Badenoch or Robert Jenrick will be announced as the winner of the election to replace Rishi Sunak.",
        "Tory leadership race: Seven things you might have missed",
        "Nearly four months after the Conservatives went down to their worst defeat in a general election in their history, they are about to anoint a new leader. \r\nEither Kemi Badenoch or Robert Jenrick will… [+5060 chars]",
        "Gen. Chance Saltzman, head of the US military's space operations, is more worried about China's space capabilities than Russian nuclear space weapons.",
        "China is sending military gear into orbit at a 'mind-boggling' pace, says US Space Force chief",
        "US Space Force General Chance Saltzman said he is concerned about the rapid pace at which China's space military capabilities are growing.SAUL LOEB/AFP via Getty Images\r\n<ul><li>Gen. Chance Saltzman,… [+3311 chars]"
    ],
    "2024-10-14": [
        "The former first minister was in the process of suing the Scottish government when he died on Saturday.",
        "Salmond ally hopes family will continue legal action",
        "Alex Salmond launched fresh legal action against the Scottish government in November 2023 \r\nThe acting leader of the Alba Party says he hopes Alex Salmond's legal case against the Scottish government… [+4078 chars]",
        "\"Terrifier 3\" made $18 million in its opening weekend, after \"Terrifier 2\" made $12 million in total. Fans say Art the Clown is the new Freddy Krueger.",
        "Ultra-gory 'Terrifer 3' kicks 'Joker 2' off the top of the box office chart, as Art the Clown is hailed a new horror icon",
        "David Howard Thornton as Art the Clown in \"Terrifier 3.\"Signature Entertainment/Cineverse\r\n<ul><li>Extreme horror \"Terrifier 3\" made $18 million in its opening weekend.</li><li>\"Terrifier 3\" kicked \"… [+3708 chars]"
    ],
    "2024-10-07": [
        "Former deputy leader Baroness Harman praises Sue Gray after she quits in a government reshuffle.",
        "Labour veteran says 'missteps' to be expected",
        "Former deputy Labour leader Baroness Harriet Harman has said \"missteps\" and \"clunkiness\" should be expected when a new administration arrives in Downing Street. \r\nShe was speaking to the BBC after Su… [+3506 chars]",
        "State lawmakers from both parties are expanding protections for patients burdened by medical debt.",
        "Medical debt snares millions of people. States, red and blue are passing laws to help",
        "While hot-button health care issues such as abortion and the Affordable Care Act roil the presidential race, Democrats and Republicans in statehouses around the country have been quietly working toge… [+5806 chars]",
        "James Fishback and his former employer Greenlight Capital have been in a legal battle since last October.",
        "Greenlight's alleged former head of macro is hoping to get at least $5 million from David Einhorn, claiming age discrimination",
        "Greenlight's David Einhorn is in a legal fight with a former employee.Brendan McDermid/ Reuters\r\n<ul><li>James Fishback, the former Greenlight analyst who said he was the head of macro, filed an arbi… [+5705 chars]"
    ],
    "2024-11-02": [
        "North America correspondent Anthony Zurcher explores a disgraced White House exit and a comeback for the ages.",
        "How Donald Trump came back from the political abyss",
        "When Donald Trump lost to Joe Biden in 2020, it seemed to be the death knell of his political career.\r\nHis first term in office ended in chaos and condemnation - even from members of his own party.\r\n… [+18875 chars]"
    ],
    "2024-10-12": [
        "A longtime conservative, alienated by Trumpism, tries to come to terms with life on the moderate edge of the Democratic Party",
        "Confessions of a Republican Exile",
        "Politically, Im a bit of a wanderer. I grew up in a progressive family and was a proud democratic socialist through college. Then, in the Reagan-Thatcher era of the 1980s, after watching the wretched… [+19394 chars]",
        "Keir Starmer tells BBC Newscast the job has been \"much tougher than anything I've done before, but much better\".",
        "Starmer says he's faced 'choppy days' since becoming PM",
        "Sir Keir Starmer has admitted he has faced choppy days in his first three months as prime minister.\r\nSpeaking to the BBCs Newscast, the prime minister said his new job had been much tougher than anyt… [+3810 chars]",
        "Salmond, as then leader of the Scottish National Party, led the independence campaign in the referendum in 2014.",
        "Former Scottish First Minister Alex Salmond, Who Sought Scotland’s Independence, Dies at 69",
        "LONDON Alex Salmond, the former first minister of Scotland who for decades championed Scotlands independence from the U.K., has died. He was 69.\r\nSalmond, who was a divisive figure in British politic… [+1796 chars]",
        "Germany's centre-right Christian Democrats (CDU) and their Bavarian sister party on Saturday set their sights firmly on victory in the 2025 parliamentary...",
        "Germany's conservatives 'determined' to win 2025 federal election",
        "Germany's centre-right Christian Democrats (CDU) and their Bavarian sister party on Saturday set their sights firmly on victory in the 2025 parliamentary elections.\r\n\"We are determined to win this Bu… [+4781 chars]"
    ],
    "2024-10-31": [
        "BBC Verify investigates the claim by Elon Musk that Democrats import illegal immigrants to vote.",
        "Investigating Musk's far-fetched claim about Democrats importing voters",
        "Since endorsing Donald Trump for president in July, Elon Musk - the owner of X - has posted about the US election hundreds of times, attracting more than four billion views.\r\nBBC Verify, working with… [+7660 chars]",
        "The devolved Scottish government will have had an extra £3.4bn to spend - including more money than SNP ministers anticipated for public building projects.",
        "Labour budget sets the scene for 2026 Holyrood election",
        "Anas Sarwar promised there would be no austerity under Labour ahead of Rachel Reeves announcing her budget \r\nThe UK government's autumn Budget should help Scottish Labour fight the Holyrood elections… [+4289 chars]",
        "Among the policies announced by the chancellor, some will have a direct impact on younger people.",
        "Six ways the Budget will affect you if you're under 25",
        "Some policies announced by Chancellor Rachel Reeves in the Budget will have a specific impact on younger people. \r\nHere are some of the key ones.\r\n1. You may pay more for your bus fare\r\nThe single bu… [+4637 chars]",
        "With five days left until Election Day, the candidates are expected to make a pitch to Latino voters in Arizona and Nevada — and talk about border security, one of the biggest issues for the campaign.",
        "Harris and Trump will bring their closing arguments to 2 key Southwest swing states",
        "The presidential campaign heads west on Thursday as Vice President Harris and former President Donald Trump take their closing arguments to voters in the critical swing states of Arizona and Nevada.\r… [+2493 chars]",
        "Former Governor of California Arnold Schwarzenegger joins a growing number of Republicans who are voting for Kamala Harris over Donald Trump.",
        "The Republicans Crossing Party Lines and Voting For Harris Over Trump",
        "With the general election between Vice President Kamala Harris and former President Donald Trump upon us, endorsements from high-profile figures hold much significance. Especially those that involve … [+10120 chars]",
        "The complexities of how our prosecutions work can mean there are limits on what the public can know.",
        "The questions being asked over the Southport attack",
        "Axel Rudakubana appeared in court on Tuesday facing further charges\r\nEver since the Southport attack in July, social media has been awash with misinformation, rumours and lies about what happened and… [+6510 chars]"
    ],
    "2024-10-11": [
        "Something strange is going on with Gen Z.",
        "Young Men Are Going in a Very Different Direction From Young Women. It Could Completely Upend Society.",
        "Something strange is going on with young men in America. For decades, young voters have leaned left compared to older ones: Millennials remain the most liberal generation of American adults, and as m… [+7845 chars]"
    ],
    "2024-10-06": [
        "Those working alongside the ex-chief of staff were flipping angry, the BBC's political editor writes.",
        "Chris Mason: Why it was always likely Sue Gray would go",
        "Sue Gray has quit as the prime minister's chief of staff\r\nWhen I leaked Sue Grays salary last month, details of her pay were less important than what the leak revealed about the anger of those alongs… [+2868 chars]"
    ],
    "2024-10-16": [
        "The move is seen by critics to target LGBT couples, who are not allowed to adopt or use IVF in the country.",
        "Italy bans couples from travelling abroad for surrogacy",
        "Italy has made it illegal for couples to go abroad to have a baby through surrogacy.\r\nThe move extends a ban on the practice inside the country to also include those who seek it out in places where i… [+3302 chars]",
        "It seems increasingly likely Alex Mitchell will not be available for the Autumn internationals with England as he recovers from a neck injury.",
        "Saints take 'conservative approach' over Mitchell injury",
        "\"So basically, a conservative approach is the best approach. We are sort of sat on our hands a little bit, waiting to see how he is. \r\n\"He is improving, but he is improving very slowly, and it is how… [+1848 chars]",
        "Rep. Thomas Massie of Kentucky also wrote his own name in for vice president. \"I do NOT recommend this,\" he wrote.",
        "House Republican spurns Trump and writes in Ron DeSantis for president — and himself for VP",
        "Rep. Thomas Massie of Kentucky posted a photo of his ballot on social media on Tuesday. \"I do NOT recommend this,\" he wrote.Bill Clark/CQ-Roll Call via Getty Images\r\n<ul><li>Rep. Thomas Massie, a Rep… [+2076 chars]",
        "Sir Keir Starmer has been urged to transfer powers to the Scottish government to help address labour shortages.",
        "UK government not considering Scottish visa to attract migrants",
        "Home Secretary Yvette Cooper is being urged to allow the Scottish government to set up bespoke immigration rules \r\nThe UK government is not considering a Scottish immigration visa system to help attr… [+3800 chars]"
    ],
    "2024-10-22": [
        "Some 1,100 prisoners will be released, excluding those convicted of murder, sex crimes and terrorism.",
        "More prisoners to be freed early to ease overcrowding",
        "The government is to release 1,100 more prisoners early, as part of its strategy to ease overcrowding in jails in England and Wales.\r\nPeople convicted of murder, sex crimes or terrorism will not be e… [+3198 chars]",
        "\"The playbook to get out of this is that you inflate your way out,\" Jones said about America's ballooning national debt.",
        "Legendary investor Paul Tudor Jones says he's buying gold and bitcoin pre-election because inflation will rise under both Trump and Harris",
        "Paul Tudor Jones is holding gold, bitcoin, and commodities to hedge against inflation, as neither presidential candidate has a plan suitable for tackling US debt, the legendary investor said.\r\nThe bi… [+2252 chars]",
        "Herbert Kickl's far right party won the elections, but no other party would form a governing coalition with him.",
        "Austria far right shunned from coalition despite winning election",
        "Austrias President, Alexander Van der Bellen, has asked the leader of the conservative Peoples Party (OVP) and incumbent Chancellor Karl Nehammer to form a coalition government - despite the fact tha… [+1993 chars]",
        "Former Rep. Liz Cheney, R-Wyo., a top GOP voice opposing Donald Trump, tore into the former president Tuesday over the Jan. 6, 2021, Capitol riot and his tariff policies.",
        "Cheney keeps up fire on Trump over Jan. 6, bashes tariff policy",
        "Former Rep. Liz Cheney, a top GOP voice opposing Donald Trump, tore into the former president Tuesday over the Jan. 6, 2021, mob attack on the U.S. Capitol and his tariff policies.\r\nSpeaking with ABC… [+3215 chars]"
    ],
    "2024-10-08": [
        "The UK's population has still increased, with net migration the main contributor.",
        "UK annual deaths outnumbered births, figures show",
        "Deaths have outnumbered births annually in the UK for the first time in nearly 50 years, excluding the Covid pandemic, new official figures show.\r\nThere were 16,300 more deaths than births in the yea… [+3664 chars]",
        "The ATF classifies the kits as firearms under the 1968 Gun Control Act, but kit manufacturers and sellers challenged the rule in court, asserting that the ATF had exceeded its authority.",
        "Supreme Court majority may embrace ATF's ghost gun rule",
        "The conservative Supreme Court, largely hostile to gun regulations in recent years, seemed tentatively supportive of the Biden administrations effort to curb ghost guns.\r\nThese build-it-yourself gun … [+5336 chars]",
        "There is some concern tax rises in the Budget could prompt an exit of the super-rich, hurting UK finances.",
        "Amount UK's richest pay in income tax revealed",
        "Sixty of the wealthiest people in the UK collectively contributed more than £3bn a year in income tax, the BBC has learned.\r\nThe amount of income tax they paid is roughly equivalent to around two-thi… [+4159 chars]"
    ],
    "2024-10-09": [
        "Sheku Bayoh's family want the inquiry to investigate the Crown Office decision not to bring any prosecutions over the case.",
        "'No closure' for family without wider inquiry into Bayoh death",
        "Kadi Johnson, sister of Sheku Bayoh speaking to journalists outside the public inquiry in Edinburgh\r\nThe sister of Sheku Bayoh says her family will have \"no closure\" unless the scope of the public in… [+3191 chars]",
        "A judge on Monday ruled against Google in its battle against Epic Games. Experts told BI the ruling shows how antitrust law has turned on Big Tech.",
        "Judge's ruling against Google in Epic Games case highlights a shift in antitrust law",
        "Google has faced a recent series of antitrust rulings that could cost the tech giant billions.ALAIN JOCARD/AFP via Getty Images\r\n<ul><li>A California judge on Monday ruled Google must open up Android… [+5105 chars]"
    ],
    "2024-10-30": [
        "Labour's first Budget in 14 years had a lot to say about growth, but forecasts paint a mixed picture.",
        "Faisal Islam: Where is the growth in Reeves' 'Budget for growth'?",
        "Chancellor Rachel Reeves repeatedly called this a \"Budget for growth\". Is it? \r\nOver the next two years, yes. But the UK's official independent forecaster's verdict is that all the measures in the Bu… [+3568 chars]",
        "It’s no secret that X has become an even bigger cesspool of misleading information, unchecked claims and flat-out falsities since Elon Musk took over. Two new reports from The Center for Countering Digital Hate (CCDH) and The Washington Post reveals that the …",
        "X’s Community Notes feature has one job, and it’s failing to do it",
        "If you click 'Accept all', we and our partners, including 237 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+678 chars]",
        "BBC correspondents analyse how much Budget money has been pledged in key areas and where the money will be spent.",
        "NHS, schools, transport: What the new Budget money is being spent on",
        "Rachel Reeves has announced billions of pounds of spending as part of the Budget.\r\nHere BBC correspondents analyse how much money has been pledged in key areas and where the money will be spent.\r\nHea… [+3967 chars]"
    ],
    "2024-10-18": [
        "During a stopover for Trump in the pivotal swing state of Pennsylvania, Musk seemed to gesture at debunked conspiracy theories.",
        "Elon Tempts Fate With Dominion Voting Conspiracy Theory",
        "Elon Musk has been campaigning hard for Donald Trump, in an effort to get his fellow billionaire re-elected President. A big part of Musk’s political strategy thus far has been to rile up conservativ… [+3968 chars]"
    ],
    "2024-10-17": [
        "Radio Campesina has a big goal this year: combat misinformation about elections among Arizona Latinos.",
        "From rodeos to radio, inside the Arizona fight against misinformation",
        "PHOENIX Tucked in the historically Latino east side of Phoenix, Ariz. is the broadcast studio of Radio Campesina. Founded by labor activist César Chávez in California, the station has broadcast acros… [+6777 chars]",
        "Councillors vote to cut council tax premium, six months after a higher rate of 200% was brought in.",
        "Tourism hotspot cuts council tax on second homes",
        "A 200% council tax premium introduced in April trebled bills \r\nOne of Wales' tourism hotspots has voted to make it cheaper to own a second home.\r\nPembrokeshire councillors have agreed to reduce the c… [+4504 chars]",
        "An Arizona judge unsealed Gallego divorce filings Wednesday, rejecting efforts to keep the records hidden. Yet the filings did not offer the October surprise the Democratic Senate candidate's rival, Kari Lake, was hoping it would.",
        "Judge unseals Ruben Gallego divorce filing that has hovered over Arizona senate race",
        "Newly unsealed divorce records reveal U.S. Senate hopeful Ruben Gallego petitioned to end his marriage with Phoenix Mayor Kate Gallego in 2016.\r\nThe nearly year-long court battle to have those record… [+3577 chars]"
    ],
    "2024-10-19": [
        "Wales' older people's commissioner says people will die because of the decision.",
        "Fear that winter fuel payment cut will cost lives",
        "Disability Wales chief executive Rhian Davies has also added her concerns about the cut in the winter fuel payments\r\nMore pensioners will die because of the decision to withdraw the winter fuel payme… [+3799 chars]"
    ],
    "2024-10-26": [
        "The chancellor says the government will ensure that 50 schools in England are rebuilt every year.",
        "Reeves pledges £1.4bn for 'crumbling' classrooms",
        "The BBC has been looking into why targets for the government's School Rebuilding Programme have been missed.\r\nThe government has pledged £1.4bn to meet a target of rebuilding 50 schools in England a … [+5148 chars]"
    ],
    "2024-10-10": [
        "A meteorologist explains why dozens of twisters touched down across the Florida peninsula before the storm's landfall.",
        "Here’s Why Hurricane Milton Caused So Many Tornadoes",
        "Hurricane Milton caused serious damage across central Florida yesterday, making landfall as a Category 3 storm near Sarasota that has killed at least five and left over three million people without p… [+7675 chars]"
    ],
    "2024-10-13": [
        "Culture is: “People like us do things like this.” We might even have a chance to choose our group. Hipsters do this, hippies do that. People in this town wear this outfit, students at this school hang out here on Saturdays… We might be born into a culture. Le…",
        "Amplifying the fringes",
        "Culture is: “People like us do things like this.”\r\nWe might even have a chance to choose our group. Hipsters do this, hippies do that. People in this town wear this outfit, students at this school ha… [+2872 chars]"
    ],
    "2024-10-05": [
        "Elon Musk was listed just below Donald Trump's family but above JD Vance in the campaign's list of attendees for Saturday's rally in Pennsylvania.",
        "Elon Musk says he will speak at Donald Trump's rally in Pennsylvania",
        "Elon Musk is set to join former President Donald Trump as the candidate returns to Butler, Pennsylvania, where he was nearly assassinated in July.Susan Walsh/AP. Evan Vucci/AP.\r\n<ul><li>Elon Musk is … [+3139 chars]",
        "The annual Supreme Court docket harvest festival begins.",
        "Why We’re Boycotting The Annual SCOTUS Term Preview",
        "Democracy had a pretty rough ride at the Supreme Court last term. Presidents have criminal immunity now! Agency experts arent the experts anymore! Sure, you can convert that rifle into an automatic w… [+1412 chars]"
    ]
}