{
    "2024-10-30": [
        "[Removed]",
        "[Removed]",
        "It’s no secret that X has become an even bigger cesspool of misleading information, unchecked claims and flat-out falsities since Elon Musk took over. Two new reports from The Center for Countering Digital Hate (CCDH) and The Washington Post reveals that the …",
        "X’s Community Notes feature has one job, and it’s failing to do it",
        "America PAC door knockers were flown to Michigan, driven in the back of a U-Haul, and told they’d have to pay hotel bills unless they met unrealistic quotas. One was surprised they were working to elect Donald Trump.",
        "Workers Say They Were Tricked and Threatened as Part of Elon Musk’s Get-Out-the-Vote Effort",
        "\"It’s what happens when you let a bunch of grifters take over,” a Trumpworld source said. Still, the polls remain even.",
        "Donald Trump's Ground Game in Michigan Is Mostly Glitchy Apps and Vibes",
        "On the anniversary of President Biden's executive order on AI, the White House says it has met all its year-one goals.",
        "The Biden Administration Touts Its Big Year in AI",
        "The Democratic presidential candidate delivers her final message a week before election day.",
        "Harris pledges 'different path' at site of Trump 6 January rally",
        "It is the first presidential election since the top court overturned Roe v Wade, which protected the nationwide right to an abortion.",
        "'I'm not a one-issue voter, but this is huge': Abortion decided these women's votes",
        "Early voting is still underway in most states, but do you'll want to check some online resources to make sure you're headed to the right place.",
        "Where Can I Vote Early? It's Simple to Find the Answer Online",
        "Political prognosticators legally bet over $100 million on the 2024 presidential election, favoring Harris over Trump.",
        "Americans bet $100 million on Trump v. Harris, but at what cost?",
        "NPR sits down with North Carolina pastor Chad Harvey to talk about Donald Trump, religion and politics.",
        "Why are some Evangelicals drawn to — and sticking by — Trump? This pastor weighs in"
    ],
    "2024-10-22": [
        "When Elon Musk introduced Tesla's robotaxi, the Cybercab, earlier this month, he showed a slide during his presentation that probably looked familiar to Blade Runner 2049 fans. It featured the back of a person wearing a trench coat against a desert-like lands…",
        "Blade Runner 2049 producer sues Elon Musk for image used in Cybercab launch",
        "Trump's narcissism knows no bounds.",
        "Donald Trump’s iPhone Wallpaper Is Just a Photo of Himself",
        "Is the tech billionaire breaking the law? We may soon find out.",
        "Justice Department Says It Has Received Complaints About Elon Musk’s $1 Million Payments to Voters",
        "The social media giant banned dozens of accounts that posting publicly available information, citing the harm they posed to celebrities.",
        "Meta Bans Accounts Tracking Private Jets of Celebs and Russian Oligarchs",
        "Battery life, camera, and AI features are key in a base model battle between the Apple iPhone 16 and Google Pixel 9.",
        "Apple iPhone 16 vs Google Pixel 9: A Base Model Brawl",
        "\"The playbook to get out of this is that you inflate your way out,\" Jones said about America's ballooning national debt.",
        "Legendary investor Paul Tudor Jones says he's buying gold and bitcoin pre-election because inflation will rise under both Trump and Harris"
    ],
    "2024-10-28": [
        "Some of the most powerful people in Silicon Valley appear to be quietly sitting out the presidential election cycle. But Trump says that in private, it's a different story.",
        "A Running List of the Tech CEOs Donald Trump Claims Are Calling Him to Suck Up",
        "A government memo viewed by WIRED states that insider threats “could derail or jeopardize a fair and transparent election process.”",
        "US Intel Says Insider Threats Are 'Likely' During the Election",
        "Who is Tony Hinchcliffe?",
        "Google Searches for Comedian Who Told Racist Jokes at Trump Rally Surpass Taylor Swift",
        "The lawsuit is the first official legal action against the billionaire's election lottery scheme.",
        "Musk Screams at Trump Rally as Philly DA Sues to Stop $1 Million Voter Giveaway"
    ],
    "2024-10-16": [
        "Investors scooped up only a small number of the Trump family's new World Liberty Financial crypto tokens after website reliability issues interfered with a launch event.",
        "Trumpcoin Launches With a Whimper",
        "The Tesla CEO called his PAC \"centrist\" because you can just say whatever you want on the internet.",
        "Elon Musk Donates $75 Million to His Own Pro-Trump Group",
        "The weird new urban development plan seeks to remake human society.",
        "Praxis: Another Tech-Billionaire Backed Urban Project Gets $525 Million in Funding",
        "The letter criticising Israel over Gaza aid is an attempt to redress the balance between the US and its ally, our international editor says.",
        "Bowen: US threat to cut Israel military aid is sign of anger at broken promises",
        "The former president has positioned himself as the pro-crypto candidate this election cycle. But he hasn't always had nice things to say about crypto.",
        "Trump flip-flopped on crypto, but his PAC has raked in millions of dollars of crypto donations since June",
        "Marc Andreessen and Ben Horowitz each donated $2.5 million to \"Right for America,\" a pro-Donald Trump super PAC, according to FEC filings.",
        "Marc Andreessen and Ben Horowitz each donated $2.5 million to a pro-Donald Trump super PAC"
    ],
    "2024-10-31": [
        "The group has nearly 50,000 members, many enthusiastically sharing debunked claims about voting fraud. “It's just an election denier jamboree,” says one expert.",
        "Elon Musk's America PAC Has Created an Election Denial Cesspool on X",
        "If you thought 2020 was bad, decisions from Big Tech and the US government have led to an internet that’s even worse off.",
        "Ahead of the Election, Social Media Platforms Have Given Up",
        "A successful CIA hack of Venezuela's military payroll system, insider fights for spy agency resources, and messy opposition politics: A WIRED investigation reveals a secret Trump-era attempt to oust autocratic ruler Nicolás Maduro.",
        "The Untold Story of Trump's Failed Attempt to Overthrow Venezuela's President",
        "The state has been written off as a woke wasteland. But it's still inventing the future on a bunch of frontiers nobody's talking about. Even if Trump wins, it will remain a golden, global example.",
        "After the Election, California (Yes, That Hellscape) Will Keep Moving the World Forward No Matter What",
        "We’ve asked every member of Congress whether they’ll accept the results as called by the Associated Press. Use our tool to see how your representatives answer.",
        "Will Your Elected Officials in Congress Accept the Results of the Election?",
        "What a garbage heap.",
        "Scammy Ads on Facebook and Instagram Viewed 900 Million Times: Report",
        "BBC Verify investigates the claim by Elon Musk that Democrats import illegal immigrants to vote.",
        "Investigating Musk's far-fetched claim about Democrats importing voters",
        "Ukrainians on the front lines tell the BBC's James Waterhouse that their country’s survival is in the hands of Americans.",
        "As US votes, Ukraine’s future hangs in balance",
        "It's not the security of the election process that experts are worried about, it's the efforts to discredit that process.",
        "Election 2024 Will Be Fair and Secure, Experts Say. Disregard the Noise",
        "Trump is proposing two policies that could result in a double-shock for the US economy, according to Nobel economist Paul Krugman.",
        "The US economy is in for a double shock if Trump is elected president, Nobel economist Paul Krugman says"
    ],
    "2024-10-29": [
        "Within hours of being freed from a low-security prison where he’d been serving time on contempt charges, the MAGA architect was rallying his troops on a Rumble stream.",
        "Steve Bannon Is Out of Prison and Spreading Lies Online",
        "Trump has promised to roll back Biden’s EV policies on “day one,” while Harris has avoided wading into the bizarre politicization of electric vehicles.",
        "This election will decide what kind of car you’ll buy",
        "As part of his overtures to the crypto industry, Donald Trump has promised to fire embattled SEC chair Gary Gensler on ‘day one.’",
        "The future of crypto regulation comes down to one unpopular man",
        "Vice President Kamala Harris is taking on former President Donald Trump. The election will determine the future of everything from electric cars to the entire legal system to to our democracy itself.",
        "The Verge’s guide to the 2024 presidential election",
        "A strange tactic to take a week before an election, to say the least.",
        "Elon Musk Keeps Saying Trump Will Tank the Economy",
        "The accounts are part of pro-Trump and pro-Harris networks sharing each other’s content multiple times a day.",
        "How X users can earn thousands from US election misinformation and AI images",
        "Our chief international correspondent Lyse Doucet hears from leading experts about what's at stake ahead of the vote.",
        "How this US election could change state of the world"
    ],
    "2024-11-01": [
        "Canvassers for California representative Michelle Steel are suing the congresswoman's campaign, America PAC, and others, alleging that they were promised hourly wages, then told pay would depend on how many doors they knocked.",
        "Elon Musk’s America PAC Hit With Class Action Lawsuit",
        "A disinformation campaign is using the unmoderated spaces of right-wing news website comment sections to push their narratives.",
        "A Russian Disinfo Campaign Is Using Comment Sections to Seed Pro-Trump Conspiracy Theories",
        "With bombs, brawls, and stolen mail-in ballots already in play, the 2024 election is shaping up to be exceptionally chaotic. WIRED is tracking these incidents as they unfold.",
        "Election Violence Is Already Here",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney",
        "\"Let's see how she feels about it, you know, when the guns are trained on her face,\" Trump said while criticizing Cheney's support of the U.S.-led conflicts in the Middle East.",
        "Trump, using violent language, attacks 'war hawk' Liz Cheney"
    ],
    "2024-10-23": [
        "A report from the US Department of Homeland Security claims that self-identified militia members have posted the names and photos of US government officials in reaction to their work on the US-Mexico border.",
        "Judges and Border Police Targeted by Anti-Government Extremists, Doxed as 'Traitors'",
        "Trump has previously called real videos of himself doing something embarrassing \"fake\" or AI.",
        "Why Are Trump Supporters Suddenly Freaked Out About Deepfakes?",
        "Recent, weirdly large pro-Trump bets have caught the attention of the platform's executives.",
        "Polymarket Is Looking Into Its Big Trump Bettors",
        "\"I think this was orchestrated by deep state Harris supporters after Trump’s visit to McDonald’s,\" one Trump supporter wrote.",
        "MAGA Faithful Say McDonald’s E. Coli Outbreak Is a Conspiracy to Hurt Trump",
        "Another legal issue to toss into the pile that he'll just ignore.",
        "Justice Department Warns Elon Musk That His $1 Million Voter Giveaway Might Be Illegal",
        "While there have been signs the Atlantic Meridional Overturning Circulation has slowed, it could soon stop altogether. That would be very, very bad.",
        "Global Catastrophe Looms as Key Ocean Current Nears Collapse, Experts Warn",
        "Sir Keir Starmer says his party sends volunteers to the US for 'pretty much every' presidential election.",
        "Labour volunteers helping Harris 'in spare time' - Starmer"
    ],
    "2024-10-10": [
        "The increasingly outspoken tech mogul spoke at a Trump rally this weekend in one of the most contested battleground states.",
        "Will Elon Musk Tip the Election for Trump?",
        "The Federal Communications Commission rejected Trump’s call to revoke CBS’s broadcast license due to sharing two edits of Harris’ response to an interview question.",
        "FCC chair rejects Trump’s call to revoke CBS license over Harris interview edit",
        "Russian state media and right-wing influencers on X helped share disinformation about Disney.",
        "Fake Photos of Disney World Destroyed by Hurricane Milton Flood Social Media",
        "Severe weather in Florida has killed at least 10 people.",
        "The Most Shocking Images of Hurricane Milton Damage So Far"
    ],
    "2024-10-21": [
        "Donald Trump's opposition to “woke” safety standards for artificial intelligence would likely mean the dismantling of regulations that protect Americans from misinformation, discrimination, and worse.",
        "How a Trump Win Could Unleash Dangerous AI",
        "X has truly become a garbage heap since Trump donor Elon Musk bought the site.",
        "Trump Supporters’ Fake Stories About Harris and Walz Flood the ‘For You’ Page on X",
        "The billionaire is giving away $1 million a day to registered voters. The lottery is the next evolution of politics as entertainment in America.",
        "Elon Musk Is Trying to Be the MrBeast of Politics",
        "The now-exonerated men allege Trump spoke falsely of their case with \"reckless disregard\".",
        "Central Park Five sue Trump for defamation over debate claims"
    ],
    "2024-10-24": [
        "The Trump and Harris campaigns have built huge networks of influencers and content creators. They have one last job—getting people out to vote.",
        "Influencers Get Their Final Marching Orders for the Election",
        "Voter registration has closed in Pennsylvania anyway, so he probably doesn't feel a need to keep doing it.",
        "Elon Musk Appears to Have Stopped His $1 Million Voter Giveaway"
    ],
    "2024-10-04": [
        "Neo-Nazis are joining SimpleX Chat, a relatively unknown app that received funding from Jack Dorsey and promises users there is no way for it or law enforcement to track their identity.",
        "Neo-Nazis Are Fleeing Telegram for Encrypted App SimpleX Chat",
        "Allegations surrounding \"misuse of funds, hiring of foreign contractors and interfering with product development\" are flying.",
        "Trump Media Execs Reportedly Quit Amid Complaints About CEO Devin Nunes",
        "Start making other plans if you were hoping to register online in any of these states.",
        "Register Online to Vote? Not in These 7 States",
        "The holds on the student loan forgiveness plan are only temporary right now. Here's what borrowers should know.",
        "Student Loan Forgiveness on Hold Again. Experts Explain What's Next for Debt Relief"
    ],
    "2024-10-15": [
        "A co-founder of World Liberty Financial, Trump’s decentralized finance platform, claimed more than 100,000 accredited investors signed up for the whitelist, but most haven’t bought the token.",
        "Trump’s crypto website crashed after its token went on sale",
        "After two people in the crowd fainted, Trump decided to turn his latest rally into a 'music fest.'",
        "Trump Spends 39 Minutes on Stage Listening to His Beloved Spotify Playlist"
    ],
    "2024-10-09": [
        "Tesla CEO Elon Musk is finally forced to stop hiding behind his bluster and show off a real autonomous vehicle. Anything less would be a disaster.",
        "The bill finally comes due for Elon Musk",
        "State Department correspondent Tom Bateman takes us through a year of diplomacy failures as the Middle East sits on the brink of total war",
        "Why has America failed to broker a Middle East ceasefire?"
    ],
    "2024-10-07": [
        "Two photos from the event where Musk stumped for Trump became iconic fodder for the internet.",
        "Elon Musk Leaps Into the Meme History Books at Trump Rally",
        "The website formerly known as Twitter is a hotbed of far-right disinformation on the category 5 storm.",
        "Trump Fans Go Viral With Bizarre Conspiracy Theories About Hurricane Milton",
        "There were no generic alternatives to a lifesaving drug when Shkreli jacked up its price by more than $700 per pill in 2015.",
        "Supreme Court Snubs Martin Shkreli’s Last-Ditch Bid to Avoid $64 Million Fine",
        "The rising costs of groceries and rent are driving many young voters to the polls.",
        "For Gen Z, US election is all about the economy",
        "Get up to speed on the rapidly evolving world of AI with our roundup of the week's developments.",
        "OpenAI Makes History Again, This Time by Scoring Billions From Investors"
    ],
    "2024-10-18": [
        "During a stopover for Trump in the pivotal swing state of Pennsylvania, Musk seemed to gesture at debunked conspiracy theories.",
        "Elon Tempts Fate With Dominion Voting Conspiracy Theory",
        "The huge buy is further proof that predictive betting sites are only a reflection of what degenerate gamblers are willing to spend.",
        "$30 Million Is All It Took to Shift the Odds in Trump’s Favor on Polymarket",
        "The campaign pushes users to IWillVote.com to make sure they're registered.",
        "Dems Launch Taylor Swift Snapchat Filter to Target Young Voters for Kamala Harris"
    ],
    "2024-10-25": [
        "The billionaire has been chatting with Russia's authoritarian leader for years while he stumps for Trump and commands huge government contracts.",
        "With Putin Calls, It’s More Clear Than Ever That Elon Musk Is a National Security Threat",
        "Newspaper endorsements don't matter much, it's the principle of management stopping them that matters.",
        "Jeff Bezos Reportedly Stops Washington Post From Making a Presidential Endorsement"
    ],
    "2024-10-08": [
        "Musk also claimed liberal states were \"making crime legal\" during an interview with Tucker Carlson.",
        "Elon Musk Says He Might Get Thrown in Jail If Trump Doesn’t Win"
    ],
    "2024-10-14": [
        "CalMatters and The Markup used Facebook’s AI model to count the millions of dollars it makes after violent news events.",
        "How Meta Brings in Millions Off of Political Violence",
        "The film, which has received mixed reviews, falls to third spot in its second week on the chart.",
        "Joker sequel suffers $33m collapse at box office"
    ],
    "2024-10-11": [
        "The billionaire has made these kinds of promises before. Many times.",
        "Elon Musk Hilariously Claims Tesla Cybercab Will Be Available In 2-3 Years"
    ],
    "2024-10-17": [
        "The European Union is making a decision that may cause any potential fines against Musk to skyrocket.",
        "The EU’s Fines Against Elon Musk May Be Much Larger Than Anticipated",
        "If she wins in November, there are indicators that Harris will keep the controversial FTC head, a new report claims.",
        "Kamala Harris Might Keep Lina Khan at the FTC, After All"
    ],
    "2024-10-05": [
        "Read the complaints submitted to the FTC by users of Donald Trump's social media platform.",
        "Truth Social Users Are Losing Ridiculous Sums of Money to Scams"
    ],
    "2024-10-26": [
        "Trump discusses the “biggest mistake” of his presidency, what he told North Korea’s leader and life in space.",
        "Seven takeaways from Trump's interview with Joe Rogan",
        "The BBC's analysis editor examines what happened in 2020 and how the Republican might react if he were to lose again.",
        "Ros Atkins on… Would Donald Trump accept defeat?",
        "International editor Jeremy Bowen examines what Iran's response might be to Israel's latest attack.",
        "Bowen: Iran faces hard choices between risks of escalation or looking weak",
        "Pennsylvania is among the top states with the fastest-growing older population. It sets the stage for what retirement will look like in the US.",
        "A battle over the future of US retirement is playing out in Pennsylvania as the election looms"
    ],
    "2024-10-19": [
        "Sunday's presidential election is seen as a vote on whether the country looks east to Russia or west to the EU.",
        "Russian cash-for-votes flows into Moldova as nation heads to polls"
    ],
    "2024-10-12": [
        "Algorithms can watch our behaviour and determine what millions of us see when we log on.",
        "How have social media algorithms changed the way we interact?",
        "The two-page letter says that Vice President Harris is in excellent health and has “the physical and mental resiliency required to successfully execute the duties of the presidency.”",
        "Harris releases medical report, drawing another contrast with Trump"
    ],
    "2024-10-20": [
        "How we crunched the numbers for our story about what cars America drives.",
        "How we crunched the numbers",
        "Is your car more Democratic or Republican? We analyzed 1.7 million car listings to find out.",
        "Red car, blue car: see where your ride ranks on the political spectrum"
    ],
    "2024-10-13": [
        "Harris wants to make it easier for eligible voters to cast ballots and rebuild Voting Rights Act protections against racial discrimination, while Trump pushes for more restrictions to voting access.",
        "The stark divide between Harris and Trump on voting rights"
    ]
}